{
    "architectures": [
        "Qwen2ForCausalLM"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "eos_token_id": 151645,
    "hidden_act": "silu",
    "hidden_size": 896,
    "initializer_range": 0.02,
    "intermediate_size": 4864,
    "max_position_embeddings": 32768,
    "max_window_layers": 21,
    "model_type": "qwen2_fope",
    "num_attention_heads": 14,
    "num_hidden_layers": 24,
    "num_key_value_heads": 2,
    "rms_norm_eps": 1e-06,
    "rope_theta": 1000000.0,
    "sliding_window": 32768,
    "tie_word_embeddings": true,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.43.1",
    "use_cache": true,
    "use_sliding_window": false,
    "vocab_size": 151936,
    "fourier": false,
    "fourier_dim": 0,
    "fourier_init": "eye_xavier_norm",
    "fourier_init_norm_gain": 0.3,
    "fourier_separate_basis": true,
    "fourier_separate_head": true,
    "fourier_learnable": false,
    "fourier_norm": false,
    "fourier_ignore_zero": true,
    "auto_map": {
        "AutoConfig": "llamafactory.model.modeling_qwen2_fope.Qwen2FoPEConfig",
        "AutoModelForCausalLM": "llamafactory.model.modeling_qwen2_fope.Qwen2ForCausalLM"
    }
}