{
    "model_type": "qwen2_fope",
    "vocab_size": 151936,
    "hidden_size": 4096,
    "intermediate_size": 22016,
    "num_hidden_layers": 32,
    "num_attention_heads": 32,
    "num_key_value_heads": 32,
    "hidden_act": "silu",
    "max_position_embeddings": 32768,
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-6,
    "use_cache": true,
    "tie_word_embeddings": false,
    "rope_theta": 10000.0,
    "use_sliding_window": false,
    "sliding_window": 4096,
    "max_window_layers": 28,
    "attention_dropout": 0.0,
    "fourier": true,
    "fourier_dim": 0,
    "fourier_init": "eye_xavier_norm",
    "fourier_init_norm_gain": 0.3,
    "fourier_separate_basis": true,
    "fourier_separate_head": true,
    "fourier_learnable": true,
    "fourier_norm": false,
    "fourier_ignore_zero": true,
    "architectures": ["Qwen2ForCausalLM"],
    "auto_map": {
        "AutoConfig": "llamafactory.model.modeling_qwen2_fope.Qwen2FoPEConfig",
        "AutoModelForCausalLM": "llamafactory.model.modeling_qwen2_fope.Qwen2ForCausalLM"
    },
    "transformers_version": "4.44.0"
}